openfoam_codes/computeFlux/test_case/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1806                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1.0;

vertices
(
 name v1 (0 0 0)
 name v2 (10 0 0)
 name v3 (10 1 0)
 name v4 (0 1 0)

 name v5 (0 0 1)
 name v6 (10 0 1)
 name v7 (10 1 1)
 name v8 (0 1 1)
);

blocks
(
    hex (v1 v2 v3 v4 v5 v6 v7 v8) (100 10 10) simpleGrading (1 1 1)
);

edges
(
);

faces
(
);


defaultPatch
{
    name walls;
    type wall;
}

boundary
(
    inlet
    {
        type    patch;
        faces   ((v1 v5 v8 v4));
    }

    outlet
    {
        type    patch;
        faces   ((v2 v3 v7 v6));
    }
);

// ************************************************************************* //
